{"body": "@steveklabnik and @al2o3cr good point about loading on reference.\r\n\r\nI think \"loading-order hell\" may be a little strong. While it is true that the associations are going to be called on clas load which means that it would in-turn load the other class, whose associations could load another class, every association is not going to specify the `:class` option, so the world won't burn with such a change. Also, there are going to be class references to other models in models through other class methods provided by other gems.\r\n\r\nIf that were a real problem, I think every gem would be using `:class_name` and warning others of the danger of actually referencing a class in code that might be loaded when the class is loaded. I don't want to dump on the concern though, as models can be fairly interrelated so with enough classes referenced and enough slow class loads, it could be a real problem, so maybe using `:class_name` would never be deprecated for those that have that issue. But, another way to look at it is that by the time it would be deprecated, Ruby class initialization times may be of little concern anyway.\r\n\r\nI didn't change what comes back for reflections. It will still provide the klass and class_name as it did before. I used reflections a lot, so I wouldn't mess that up. As for methods that actually had altered signatures as part of this, there were two, and those are private methods and I would hope that whatever gems are using them would be able to have another release for Rails 4.0 anyway. Besides, class attributes have been being renamed in Rails recently from some_name to _some_name to indicate they are private, which breaks a gem here and there and then those gems have to either change or use something less private.\r\n\r\nWhatever you guys and everyone else thinks is good with me, though. Just trying to make things better.", "url": "https://api.github.com/repos/rails/rails/issues/comments/10827759", "created_at": "2012-11-28T23:17:45Z", "html_url": "https://github.com/rails/rails/pull/8357#issuecomment-10827759", "updated_at": "2012-11-28T23:23:12Z", "repo": "rails", "issue_id": 8357, "user": {"following_url": "https://api.github.com/users/garysweaver/following{/other_user}", "events_url": "https://api.github.com/users/garysweaver/events{/privacy}", "organizations_url": "https://api.github.com/users/garysweaver/orgs", "url": "https://api.github.com/users/garysweaver", "gists_url": "https://api.github.com/users/garysweaver/gists{/gist_id}", "html_url": "https://github.com/garysweaver", "subscriptions_url": "https://api.github.com/users/garysweaver/subscriptions", "avatar_url": "https://2.gravatar.com/avatar/8838005371ab9c0b1d40f0504bf8832a?d=https%3A%2F%2Fidenticons.github.com%2F4eb6720c6cd70ee9e67ca6e4dc12e3df.png", "repos_url": "https://api.github.com/users/garysweaver/repos", "received_events_url": "https://api.github.com/users/garysweaver/received_events", "gravatar_id": "8838005371ab9c0b1d40f0504bf8832a", "starred_url": "https://api.github.com/users/garysweaver/starred{/owner}{/repo}", "login": "garysweaver", "type": "User", "id": 92330, "followers_url": "https://api.github.com/users/garysweaver/followers"}, "owner": "rails", "_id": {"$oid": "5237f3e9bd3543c15100a926"}, "id": 10827759, "issue_url": "https://api.github.com/repos/rails/rails/issues/8357"}
