{"body": "@NZKoz, thanks for expressing some of your concerns. I understand what you're saying, but I do not think they override the need to correctly implement Rails _and_ encourage users to use it according to HTTP specs.\r\n\r\nFirst, adherence to the HTTP spec isn't \"religious\" but practical and common sense. Letting Rails be a proper citizen of the HTTP ecosystem will help the platform inter-operate better with caches, proxies, browsers, and other HTTP clients. Refraining from using proper HTTP semantics might cause other problems, such as security issues, that we can't foresee as of now.\r\n\r\nAs for saying that changing defaults \"breaks far too much to be worth it\", if we follow your line of argument, we would never be able to move forward. I'm of the opinion that fixing the way 90% of apps use HTTP is worth breaking expectations and documentation, especially since the change is backwards compatible and allows users to override the defaults (just as you suggested, except in reverse).\r\n\r\nMost likely, the change would not be a problem since it would come with a clear warning from Rails release notes and documentation.\r\n\r\nFinally, Rails is a good instructor and scaffold of how to build proper web apps, and in filling this role, it should itself use proper HTTP semantics. That's why we have \"RESTful\" routes in the first place! :)\r\n\r\nI hope this addresses your concerns. With strides in Rails in the proper direction, hopefully we'll have a huge number of applications, documents, and books that refer to proper HTTP semantics.", "url": "https://api.github.com/repos/rails/rails/issues/comments/1121231", "created_at": "2011-05-09T05:04:25Z", "html_url": "https://github.com/rails/rails/pull/431#issuecomment-1121231", "updated_at": "2011-05-09T05:04:25Z", "repo": "rails", "issue_id": 431, "user": {"following_url": "https://api.github.com/users/dlee/following{/other_user}", "events_url": "https://api.github.com/users/dlee/events{/privacy}", "organizations_url": "https://api.github.com/users/dlee/orgs", "url": "https://api.github.com/users/dlee", "gists_url": "https://api.github.com/users/dlee/gists{/gist_id}", "html_url": "https://github.com/dlee", "subscriptions_url": "https://api.github.com/users/dlee/subscriptions", "avatar_url": "https://2.gravatar.com/avatar/139de3f8c3d6ee008cdb3abd3da23908?d=https%3A%2F%2Fidenticons.github.com%2F80177fe965b78111f4dfee80cfdc3689.png", "repos_url": "https://api.github.com/users/dlee/repos", "received_events_url": "https://api.github.com/users/dlee/received_events", "gravatar_id": "139de3f8c3d6ee008cdb3abd3da23908", "starred_url": "https://api.github.com/users/dlee/starred{/owner}{/repo}", "login": "dlee", "type": "User", "id": 7035, "followers_url": "https://api.github.com/users/dlee/followers"}, "owner": "rails", "_id": {"$oid": "52386048bd3543c151012243"}, "id": 1121231, "issue_url": "https://api.github.com/repos/rails/rails/issues/431"}
