{"issue_url": "https://api.github.com/repos/rails/rails/issues/1213", "repo": "rails", "body": "I agree with @defeated.\r\n\r\nSo long as Rails supports both 1.8 and 1.9, it is assumed that any given Rails application **may** also support both 1.8 and 1.9. So long as Rails supports both 1.8 and 1.9, it should support them equally: in this case, that means generating code that runs equally well on both versions of Ruby.\r\n\r\nWhen and only when Rails ditches support for Ruby 1.8, then it might be nice to use 1.9-only syntax that will break under 1.8. Until then, there will be numerous minorities like @defeated with different edge cases where things break mysteriously an unexpectedly.\r\n\r\nIt is not \"sane to assume\" that development and deployment are necessarily identical, and it is not good to posit that they *should* be the same. As a popular, if tangential, example, consider someone who develops on a Mac laptop and deploys on an Ubuntu server. As a relevant example, consider someone who prefers to develop on 1.9 because it is faster, but continues to deploy on 1.8 because it has been stable for longer (he runs the tests periodically on 1.8 just to be sure, but usually runs the on 1.9 for the speed). Or, similarly, consider someone whose production environment is 1.8 but who wishes soon to move production to 1.9; in anticipation, he begins developing with 1.9, with the goal of establishing over six months that his application well on 1.9, and has even set up a staging infrastructure on 1.9, but plans to continue the 1.8 production deployment until the stability of his application on 1.9 has been established. (In this paragraph, the \"application\" may be an amalgamation of multiple Rails apps serving as its pieces, since the generated file in question is only generated for a new Rails app.)\r\n\r\nRails *should* be opinionated. It *should* be opinionated that 1.9 is preferred. It *should* lead the charge to move everyone to 1.9. But if it claims, for the time being, also to support 1.8, then it should, for the time being, also support 1.8 *well*.\r\n", "_id": {"$oid": "52385b8dbd3543c151011e51"}, "issue_id": 1213, "url": "https://api.github.com/repos/rails/rails/issues/comments/1274638", "html_url": "https://github.com/rails/rails/pull/1213#issuecomment-1274638", "updated_at": "2011-06-01T14:32:42Z", "user": {"subscriptions_url": "https://api.github.com/users/yfeldblum/subscriptions", "events_url": "https://api.github.com/users/yfeldblum/events{/privacy}", "repos_url": "https://api.github.com/users/yfeldblum/repos", "gists_url": "https://api.github.com/users/yfeldblum/gists{/gist_id}", "url": "https://api.github.com/users/yfeldblum", "login": "yfeldblum", "gravatar_id": "5eadf00e11240f05263ec7735612cd09", "html_url": "https://github.com/yfeldblum", "following_url": "https://api.github.com/users/yfeldblum/following{/other_user}", "received_events_url": "https://api.github.com/users/yfeldblum/received_events", "organizations_url": "https://api.github.com/users/yfeldblum/orgs", "avatar_url": "https://2.gravatar.com/avatar/5eadf00e11240f05263ec7735612cd09?d=https%3A%2F%2Fidenticons.github.com%2F485970c473e9165d1649e16c7aa35b83.png", "starred_url": "https://api.github.com/users/yfeldblum/starred{/owner}{/repo}", "id": 169419, "followers_url": "https://api.github.com/users/yfeldblum/followers", "type": "User"}, "created_at": "2011-06-01T14:32:42Z", "id": 1274638, "owner": "rails"}
