{"issue_url": "https://api.github.com/repos/rails/rails/issues/2361", "repo": "rails", "body": "hi @p, thanks for your comments. i'm glad this issue is being looked at.\r\n\r\nyou have my full support that i may be incorrect. i'm not overly concerned about the particulars of the code changes, but i would like to get the essential issue nailed down which i believe has been neglected. my position is that in this case port 25 is a historically broad default which rails has adopted. in context this seems anachronistic given rails has often been an agent of radical opinionated change. given the current state of email, port 587 with a username, password, and TLS encryption is preferred; port 25 should instead be elected deliberately by a knowledgable administrator.\r\n\r\n(1) i am making the assumption that the majority of rails installations are on servers that are not well-configured MTAs.\r\n\r\n(2) instead, the rails instance takes on the role of a MUA, and should send the desired initial encrypted message to an MSA.\r\n\r\n(3) alternately, if the local web application server is also a respected MTA, the rails instance should still elect separation of logic and transfer it's initial message as a \"submission\" instead of a relay transport.\r\n\r\nRFC5068 states the desired lifecycle of email as:\r\n\r\n    MUA -(587)-> MSA -(25)-> MTA -(25)-> Access Provider -> Internet -> Access Provider -(25)-> MTA -> MDA\r\n\r\nif (1) is true, my support for (2) and (3) are as follows:\r\n\r\n## http://en.wikipedia.org/wiki/Mail_submission_agent\r\n\r\n<blockquote>\r\nA mail submission agent (MSA) is a computer program or software agent that receives electronic mail messages from a mail user agent (MUA) and cooperates with a mail transfer agent (MTA) for delivery of the mail.\r\n</blockquote>\r\n\r\n\r\n## http://en.wikipedia.org/wiki/Mail_transfer_agent\r\n\r\n<blockquote>\r\nOne may distinguish initial submission as first passing through an MSA - port 587 is used for communication between an MUA and an MSA while port 25 is used for communication between MTAs, or from an MSA to an MTA\r\n</blockquote>\r\n\r\n\r\n## http://mostlygeek.com/tech/smtp-on-port-587/\r\n\r\n<blockquote>\r\nPort 587 is for users to send out emails on. Port 25 is for servers to relay messages to one another. That way ISPs can block outgoing SMTP on their networks but still allow users to send email to any mail server through port 587.\r\n</blockquote>\r\n\r\n\r\n## http://tools.ietf.org/html/rfc5068\r\n\r\n<blockquote>\r\nEmail authentication technologies are aimed at providing assurances\r\nand traceability between internetworked networks.  In many email\r\nservices, the weakest link in the chain of assurances is initial\r\nsubmission of a message.  This document offers recommendations for\r\nconstructive operational policies for this first step of email\r\nsending, the submission (or posting) of email into the transmission\r\nnetwork.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nOriginally the MSA, MTA, and MDA architectural components were\r\nconsidered to be a single unit.  This was reflected in the practice\r\nof having MSA, MTA, and MDA transfers all be performed with SMTP\r\n[RFC2821] [RFC0821], over TCP port 25.  Internet mail permits email\r\nto be exchanged without prior arrangement and without sender\r\nauthentication.  That is, the confirmed identity of the originator of\r\nthe message is not necessarily known by the relaying MTAs or the MDA.\r\n\r\nIt is important to distinguish MUA-to-MSA email submission, versus\r\nMTA relaying, versus the final MTA-to-MDA transition.  Submission\r\ntypically does entail a pre-established relationship between the user\r\nof the client and operator of the server; equally, the MDA is\r\nperforming final delivery and can determine that it has an existing\r\nrelationship with the recipient.  That is, MSAs and MDAs can take\r\nadvantage of having prior relationships with users in order to\r\nconstrain their transfer activities.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nSubmission Port Availability:\r\n\r\nIf external submissions are supported -- that is, from outside a\r\nsite's administrative domain -- then the domain's MSAs MUST\r\nsupport the SUBMISSION port 587 [RFC4409].  Operators MAY\r\nstandardize on the SUBMISSION port for both external AND LOCAL\r\nusers; this can significantly simplify submission operations.\r\n\r\nSubmission Port Use:\r\n\r\nMUAs SHOULD use the SUBMISSION port for message submission.\r\n\r\n<br><br>[...]<br><br>\r\n\r\n3.2.  Transitioning to Submission Port\r\n\r\nIn order to promote transition of initial message submission from\r\nport 25 to port 587, MSAs MUST listen on port 587 by default and\r\nSHOULD have the ability to listen on other ports.  MSAs MUST require\r\nauthentication on port 587 and SHOULD require authentication on any\r\nother port used for submission.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nA proactive technique used by some providers is to block all use of\r\nport 25 SMTP for mail that is being sent outbound, or to\r\nautomatically redirect this traffic through a local SMTP proxy,\r\nexcept for hosts that are explicitly authorized.  This can be\r\nproblematic for some users, notably legitimate mobile users\r\nattempting to use their \"home\" MSA, even though those users might\r\nalready employ legitimate, port 25-based authentication.\r\n\r\nThis document offers no recommendation concerning the blocking of\r\nSMTP port 25 or similar practices for controlling abuse of the\r\nstandard anonymous mail transfer port.  Rather, it pursues the\r\nmutually constructive benefit of using the official SUBMISSION port\r\n587 [RFC4409].\r\n\r\n<br><br>[...]<br><br>\r\n\r\nOpen Submission Port:\r\n\r\nAccess Providers MUST NOT block users from accessing the external\r\nInternet using the SUBMISSION port 587 [RFC4409].\r\n\r\n<br><br>[...]<br><br>\r\n\r\nEmail transfer between independent administrations can be the source\r\nof large volumes of unwanted email and email containing malicious\r\ncontent designed to attack the recipient's system.  This document\r\naddresses the requirements and procedures to permit such exchanges\r\nwhile reducing the likelihood that malicious mail will be\r\ntransmitted.\r\n</blockquote>\r\n\r\n\r\n## http://tools.ietf.org/html/rfc4409\r\n\r\n<blockquote>\r\nMessage relay and final delivery are unaffected, and continue to use\r\nSMTP over port 25.\r\n\r\nWhen conforming to this document, message submission uses the\r\nprotocol specified here, normally over port 587.\r\n\r\nThis separation of function offers a number of benefits, including\r\nthe ability to apply specific security or policy requirements.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nSMTP was defined as a message *transfer* protocol, that is, a means\r\nto route (if needed) and deliver finished (complete) messages.\r\n\r\nMessage Transfer Agents (MTAs) are not supposed to alter the message\r\ntext, except to add 'Received', 'Return-Path', and other header\r\nfields as required by [SMTP-MTA].\r\n\r\nHowever, SMTP is now also widely used as a message *submission*\r\nprotocol, that is, a means for Message User Agents (MUAs) to\r\nintroduce new messages into the MTA routing network.  The process\r\nthat accepts message submissions from MUAs is termed a Message\r\nSubmission Agent (MSA).\r\n\r\nIn order to permit unconstrained communications, SMTP is not often\r\nauthenticated during message relay.\r\n\r\nAuthentication and authorization of initial submissions have become\r\nincreasingly important, driven by changes in security requirements\r\nand rising expectations that submission servers take responsibility\r\nfor the message traffic they originate.\r\n\r\nFor example, due to the prevalence of machines that have worms,\r\nviruses, or other malicious software that generate large amounts of\r\nspam, many sites now prohibit outbound traffic on the standard SMTP\r\nport (port 25), funneling all mail submissions through submission\r\nservers.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nSeparating messages into submissions and transfers allows developers\r\nand network administrators to more easily do the following:\r\n\r\n<br><br>[...]<br><br>\r\n\r\n*   Separate the relevant software code differences, thereby making\r\n    each code base more straightforward and allowing for different\r\n    programs for relay and submission\r\n\r\n*   Detect configuration problems with a site's mail clients\r\n\r\n*   Provide a basis for adding enhanced submission services in the\r\n    future\r\n\r\n<br><br>[...]<br><br>\r\n\r\nMessage User Agent (MUA)\r\n\r\nA process that acts (often on behalf of a user and with a user\r\ninterface) to compose and submit new messages, and process delivered\r\nmessages.\r\n\r\n<br><br>[...]<br><br>\r\n\r\nPort 587 is reserved for email message submission as specified in\r\nthis document.  Messages received on this port are defined to be\r\nsubmissions.  The protocol used is ESMTP [SMTP-MTA, ESMTP], with\r\nadditional restrictions or allowances as specified here.\r\n\r\nAlthough most email clients and servers can be configured to use port\r\n587 instead of 25, there are cases where this is not possible or\r\nconvenient.  A site MAY choose to use port 25 for message submission,\r\nby designating some hosts to be MSAs and others to be MTAs.\r\n</blockquote>\r\n\r\n\r\n<hr>\r\n\r\naddressing your cited common-use cases of sendmail and exim, i grabbed the latest packages and am giving biased citations arrived at by `ack 587`\r\n\r\n## exim\r\n\r\n### src/exipick.src\r\n\r\n```\r\nexipick - selectively display messages from an Exim queue\r\n\r\n[...]\r\n\r\nDisplay all messages received on the MSA port, ordered first by the sender's email domain and then by the size of the emails:\r\n    exipick --sort sender_address_domain,message_size \\\r\n            '$received_port == 587'\r\n```\r\n\r\n### doc/spec.txt\r\n```\r\nAnother two commented-out option settings follow:\r\n\r\n# daemon_smtp_ports = 25 : 465 : 587\r\n# tls_on_connect_ports = 465\r\n\r\nThese options provide better support for roaming users who wish to use this\r\nserver for message submission. They are not much use unless you have turned on\r\nTLS (as described in the previous paragraph) and authentication (about which\r\nmore in section 7.7). The usual SMTP port 25 is often blocked on end-user\r\nnetworks, so RFC 4409 specifies that message submission should use port 587\r\ninstead.\r\n```\r\n\r\n\r\n## sendmail\r\n\r\n### RELEASE_NOTES\r\n```\r\n8.10.0/8.10.0   2000/03/01\r\n\r\n[...]\r\n\r\nsendmail implements RFC 2476 (Message Submission), e.g., it can\r\n        now listen on several different ports.  Use:\r\n        O DaemonPortOptions=Name=MSA, Port=587, M=E\r\n        to run a Message Submission Agent (MSA); this is turned\r\n        on by default in m4-generated .cf files; it can be turned\r\n        off with FEATURE(`no_default_msa').\r\n```\r\n\r\n### cf/cf/generic-linux.cf\r\n```\r\n# SMTP daemon options\r\nO DaemonPortOptions=Name=MTA\r\nO DaemonPortOptions=Port=587, Name=MSA, M=E\r\n```", "_id": {"$oid": "523fcababd354364b901b0d2"}, "issue_id": 2361, "url": "https://api.github.com/repos/rails/rails/issues/comments/1919274", "html_url": "https://github.com/rails/rails/pull/2361#issuecomment-1919274", "updated_at": "2011-08-27T09:50:32Z", "user": {"subscriptions_url": "https://api.github.com/users/trevor/subscriptions", "events_url": "https://api.github.com/users/trevor/events{/privacy}", "repos_url": "https://api.github.com/users/trevor/repos", "gists_url": "https://api.github.com/users/trevor/gists{/gist_id}", "url": "https://api.github.com/users/trevor", "login": "trevor", "gravatar_id": "f2b38133a59126871ff01b402721d4db", "html_url": "https://github.com/trevor", "following_url": "https://api.github.com/users/trevor/following{/other_user}", "received_events_url": "https://api.github.com/users/trevor/received_events", "organizations_url": "https://api.github.com/users/trevor/orgs", "avatar_url": "https://0.gravatar.com/avatar/f2b38133a59126871ff01b402721d4db?d=https%3A%2F%2Fidenticons.github.com%2F2e907f44e0a9616314cf3d964d4e3c93.png", "starred_url": "https://api.github.com/users/trevor/starred{/owner}{/repo}", "id": 5945, "followers_url": "https://api.github.com/users/trevor/followers", "type": "User"}, "created_at": "2011-08-27T09:50:32Z", "id": 1919274, "owner": "rails"}
