{"updated_at": "2011-08-27T15:51:12Z", "repo": "rails", "created_at": "2011-08-27T15:51:12Z", "owner": "rails", "url": "https://api.github.com/repos/rails/rails/issues/comments/1920181", "id": 1920181, "issue_url": "https://api.github.com/repos/rails/rails/issues/2361", "issue_id": 2361, "user": {"repos_url": "https://api.github.com/users/p/repos", "type": "User", "html_url": "https://github.com/p", "starred_url": "https://api.github.com/users/p/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/p/subscriptions", "following_url": "https://api.github.com/users/p/following{/other_user}", "gravatar_id": "1c7bded9fd1b6e5ca8e9f77a6222302c", "organizations_url": "https://api.github.com/users/p/orgs", "url": "https://api.github.com/users/p", "gists_url": "https://api.github.com/users/p/gists{/gist_id}", "avatar_url": "https://2.gravatar.com/avatar/1c7bded9fd1b6e5ca8e9f77a6222302c?d=https%3A%2F%2Fidenticons.github.com%2F67babe48f28145b5e7f3580a3fccd4e9.png", "id": 125612, "events_url": "https://api.github.com/users/p/events{/privacy}", "login": "p", "received_events_url": "https://api.github.com/users/p/received_events", "followers_url": "https://api.github.com/users/p/followers"}, "body": "> my position is that in this case port 25 is a historically broad default which rails has adopted. in context this seems anachronistic given rails has often been an agent of radical opinionated change. given the current state of email, port 587 with a username, password, and TLS encryption is preferred; port 25 should instead be elected deliberately by a knowledgable administrator.\r\n\r\nBy \"preferred\" you must mean \"the only option available on some hosting accounts\" as objectively one cannot prefer submission over internet to submission to a local mta. Talking to a remote msa is slow. Establishing a TLS connection as is current practice today with submission over internet is incredibly slow. If you send even a single email there will be noticeable difference between handing it off to a local msa (see below) and a remote msa. With more than one email using a remote msa becomes very noticeable and the likelihood of lost email due to network errors goes up.\r\n\r\nSubmission over localhost is normally assumed to be 100% reliable. Submission over internet cannot be expected to work 100% of the time. Even in server to server communication there are sometimes delays; if you send multiple emails at a time you have to handle network errors or risk losing all email after the one that failed.\r\n\r\nRegarding a local msa:\r\n\r\n<pre>\r\nMUA -(587)-> MSA -(25)-> MTA ->...\r\n</pre>\r\n\r\nWhen you are sending over localhost this becomes:\r\n\r\n<pre>\r\nMUA -(25)-> MSA -(25)-> MTA ->...\r\n</pre>\r\n\r\nIn this case msa and mta may be the same program, but mail software today treats local connections over port 25 very differently from remote connections over port 25. Local connections are allowed relaying, remote are not. Here are some quotes from default exim configuration file pertaining to submission over localhost:\r\n\r\n<pre>\r\nhostlist   relay_from_hosts = localhost\r\n\r\n  # Accept if the message comes from one of the hosts for which we are an\r\n  # outgoing relay. It is assumed that such hosts are most likely to be MUAs,\r\n  # so we set control=submission to make Exim treat the message as a\r\n  # submission. It will fix up various errors in the message, for example, the\r\n  # lack of a Date: header line. If you are actually relaying out out from\r\n  # MTAs, you may want to disable this. ...\r\n\r\n  accept  hosts         = +relay_from_hosts\r\n          control       = submission\r\n          control       = dkim_disable_verify\r\n</pre>\r\n\r\nNotice how the same logic is applied to authenticated submission over port 587:\r\n\r\n<pre>\r\n  # Accept if the message arrived over an authenticated connection, from\r\n  # any host. Again, these messages are usually from MUAs, so recipient\r\n  # verification is omitted, and submission mode is set. ...\r\n\r\n  accept  authenticated = *\r\n          control       = submission\r\n          control       = dkim_disable_verify\r\n</pre>\r\n\r\nThere is nothing \"anachronistic\" about using a local mta. The benefits of a local mta are the same today as they were when smtp was invented - fast acceptance of email, 100% reliability and ability to control how email is sent using software written for sending email. More people today use remote submission but remote submission continues to be inferior to a local submission.\r\n\r\nThe current behavior for local and remote submission is as follows: local submission works out of the box, remote submission requires configuration. Changing the default port will change the behavior to: local submission requires configuration (set the port back to 25), remote submission requires configuration (set username and password). Changing the default port does not help anyone using remote submission, but breaks everyone who uses local submission.\r\n\r\nThe only appropriate change here is the one in documentation, changing port from 25 to 587 when it gives an example of how to configure rails for a remote msa. That change makes sense since people who use that configuration usually use port 587.", "_id": {"$oid": "523fcababd354364b901b0d3"}, "html_url": "https://github.com/rails/rails/pull/2361#issuecomment-1920181"}
