{"body": "@stevegraham I agree with you in that the authors of the RFC5789 could be wrong, though I want to believe that you wouldn't be able to push such a proposal for so many time like they have done based on such a gross false premise. But yes, that's an hypothesis.\r\n\r\nI was for a while in rest-discuss and my feeling is that there's consensus about that interpretation of PUT. Also O'Reilly's book about REST is clear. What's a modified version of the resource? Resources in HTTP are not partial, they are resources, all or nothing, in my understanding of the terminology. You can only request and submit resources or resource representations. So in that sense I believe no verb can work with partial resources. That's where ad-hoc resources come to play, like the paid flag of an invoice in my example above.\r\n\r\nBut this thread is pulling in different directions. It's interesting. There's the objections about whether it is premature to support such a RFC because of its status. There's the objections about whether using PUT for partial updates is incorrect at all. There's the argument that Rails should be pioneer and push. Then there will be practical issues because web servers and proxies won't understand PATCH in the short term and we will only be able to tunnel it through POST.\r\n\r\nAll in all, I've written to Roy Fielding to ask for advice. I think that's the best we can do. Should Rails work in that direction? If yes, should we work on it today? Let's see whether Roy is so kind as to shed some light about this.", "url": "https://api.github.com/repos/rails/rails/issues/comments/2765218", "created_at": "2011-11-16T18:04:51Z", "html_url": "https://github.com/rails/rails/pull/505#issuecomment-2765218", "updated_at": "2011-11-16T18:21:57Z", "repo": "rails", "issue_id": 505, "user": {"following_url": "https://api.github.com/users/fxn/following{/other_user}", "events_url": "https://api.github.com/users/fxn/events{/privacy}", "organizations_url": "https://api.github.com/users/fxn/orgs", "url": "https://api.github.com/users/fxn", "gists_url": "https://api.github.com/users/fxn/gists{/gist_id}", "html_url": "https://github.com/fxn", "subscriptions_url": "https://api.github.com/users/fxn/subscriptions", "avatar_url": "https://2.gravatar.com/avatar/7223c62b7310e164eb79c740188abbda?d=https%3A%2F%2Fidenticons.github.com%2F4a11654ad1e1e48352252859ff3032a0.png", "repos_url": "https://api.github.com/users/fxn/repos", "received_events_url": "https://api.github.com/users/fxn/received_events", "gravatar_id": "7223c62b7310e164eb79c740188abbda", "starred_url": "https://api.github.com/users/fxn/starred{/owner}{/repo}", "login": "fxn", "type": "User", "id": 3387, "followers_url": "https://api.github.com/users/fxn/followers"}, "owner": "rails", "_id": {"$oid": "52385f14bd3543c15101210c"}, "id": 2765218, "issue_url": "https://api.github.com/repos/rails/rails/issues/505"}
