{"body": "@mikekelly I don't say this is the only valid interpretation. At the beginning of the thread it was my reading of the spec, and it was what other sources interpreted. It is also clear that we are not inventing this controversy, it is old.\r\n\r\nAfter this thread, we have a pulse of the generic consensus and Roy Fielding's view on this topic. And I believe that opinion is key. If Roy said \"go do partial updates with PUT\" we had already closed the PR.\r\n\r\nThis tells me that if I have to bet, I know where to bet. Not saying the other interpretation is wrong. The spec is ambiguous, so there's no right or wrong. It could be the case that the ambiguity was an overlook, I personally don't know. But what we have is consensus (different from unanimity), and the +1 of Roy Fielding regarding not doing partial updates with PUT.\r\n\r\nSo, Rails is (probably) going to provide a way for the majority of people participating in this thread that would like to do partial updates without PUT. At the same time, you will be able to continue doing partial updates via PUT.\r\n\r\nMind you, if we do something I don't expect it to be a dramatic change. At least at the beginning. It could be something discreet, like being able to say :method => :patch, and adding routing and conventions without changing defaults. Backwards compatibility must be respected, and indeed you may be doing form_for with a full-representation, which is the canonical use case of form_for reused in create and update views.\r\n\r\nAnd yes, adhering to the spec/semantics is enough for me to consider adding support for this. Why does Rails support DELETE? Couldn't people delete via POST? Sure, and we are doing it all the time, but that's irrelevant, it is the duty of Rails to give you a way to do proper DELETE. When you work with polynomials you don't say \"superscript\", you say \"exponent\". And when people mean partial update, they are going to be able to say PATCH.\r\n\r\n", "url": "https://api.github.com/repos/rails/rails/issues/comments/3194340", "created_at": "2011-12-18T12:01:17Z", "html_url": "https://github.com/rails/rails/pull/505#issuecomment-3194340", "updated_at": "2011-12-18T12:07:09Z", "repo": "rails", "issue_id": 505, "user": {"following_url": "https://api.github.com/users/fxn/following{/other_user}", "events_url": "https://api.github.com/users/fxn/events{/privacy}", "organizations_url": "https://api.github.com/users/fxn/orgs", "url": "https://api.github.com/users/fxn", "gists_url": "https://api.github.com/users/fxn/gists{/gist_id}", "html_url": "https://github.com/fxn", "subscriptions_url": "https://api.github.com/users/fxn/subscriptions", "avatar_url": "https://1.gravatar.com/avatar/7223c62b7310e164eb79c740188abbda?d=https%3A%2F%2Fidenticons.github.com%2F4a11654ad1e1e48352252859ff3032a0.png", "repos_url": "https://api.github.com/users/fxn/repos", "received_events_url": "https://api.github.com/users/fxn/received_events", "gravatar_id": "7223c62b7310e164eb79c740188abbda", "starred_url": "https://api.github.com/users/fxn/starred{/owner}{/repo}", "login": "fxn", "type": "User", "id": 3387, "followers_url": "https://api.github.com/users/fxn/followers"}, "owner": "rails", "_id": {"$oid": "52385f14bd3543c151012151"}, "id": 3194340, "issue_url": "https://api.github.com/repos/rails/rails/issues/505"}
