{"issue_url": "https://api.github.com/repos/rails/rails/issues/5580", "repo": "rails", "body": "@fxn By putting words in people's mouths, you insult them. Nobody has every said they wanted Ruby to be \"like Java\" (or like \"some imaginary programming language\" as you **plainly** accused me of saying when I **never** said any such thing).\r\n\r\nBy saying things like \"my code\" when referring to a project that has over a thousand contributors, you insult **everybody** who has ever contributed to Rails or attempted to contribute to Rails. You're from another country and perhaps English isn't your first language, so maybe you get a little slack on that one.. but please choose your words better if you don't want to seem like you're insulting people.\r\n\r\nBy saying \"If this pull request were submitted for performance reasons, I would accept it\" when you knew you had no intention of doing so, you not only insult everybody's intelligence, but you prove yourself to be a liar because you gave your word that you would do something when you knew full well that you were going to do the exact opposite. Where I come from a man's word is his bond. You gave your word, you should have done what you said you would do. Now, to me (and I'm sure many others) you've lost all credibility.\r\n\r\nBy \"talking to the core team\" about it at a time when the majority of the core team was more than likely in bed asleep or just waking up to start the day (how many did you actually talk to? 3? 4?) and then getting one of those core team members to come in here and close the pull request for you, you insult yourself further, because not only do you look like a liar but now you also look like a coward.\r\n\r\nIf you take anything I said as an insult, that's your problem, you **have** insulted me and several other people whether that was your intention or not, and you **did** lie about your intention to merge this pull request and then found someone else to do your dirty work for you when the pull request was submitted. I only speak the truth, nothing more or less, take it how you will.\r\n\r\nWhile there were parts of this discussion where I'll admit that you have been respectful, for the most part that is not true, your attitude has been rude, condescending, insulting and defensive and you've rejected almost every logicall argument with a \"because I can\" attitude that is not normal, healthy or acceptable in a community of adults.", "_id": {"$oid": "523815a3bd3543c15100dd43"}, "issue_id": 5580, "url": "https://api.github.com/repos/rails/rails/issues/comments/4709590", "html_url": "https://github.com/rails/rails/pull/5580#issuecomment-4709590", "updated_at": "2012-03-27T04:09:57Z", "user": {"subscriptions_url": "https://api.github.com/users/stevenh512/subscriptions", "events_url": "https://api.github.com/users/stevenh512/events{/privacy}", "repos_url": "https://api.github.com/users/stevenh512/repos", "gists_url": "https://api.github.com/users/stevenh512/gists{/gist_id}", "url": "https://api.github.com/users/stevenh512", "login": "stevenh512", "gravatar_id": "b3e25a674fe385ec5d985c8adf8d60aa", "html_url": "https://github.com/stevenh512", "following_url": "https://api.github.com/users/stevenh512/following{/other_user}", "received_events_url": "https://api.github.com/users/stevenh512/received_events", "organizations_url": "https://api.github.com/users/stevenh512/orgs", "avatar_url": "https://0.gravatar.com/avatar/b3e25a674fe385ec5d985c8adf8d60aa?d=https%3A%2F%2Fidenticons.github.com%2Feb5bc262e55ae62defb5de04c8848a90.png", "starred_url": "https://api.github.com/users/stevenh512/starred{/owner}{/repo}", "id": 110500, "followers_url": "https://api.github.com/users/stevenh512/followers", "type": "User"}, "created_at": "2012-03-27T04:09:57Z", "id": 4709590, "owner": "rails"}
