{"issue_url": "https://api.github.com/repos/rails/rails/issues/505", "repo": "rails", "body": "In the risk on being pedant by arguing on a closed discussion against the last three comments (@josevalim, @fxn and @myronmarston), where I even haven't any personal use case yet, I will still make my point here, since I don't know where it goes better.\r\n\r\nRails does not provide a clean way to map resources to models \"to and fro\", which makes josevalim's point somewhat valid. I mean, devs usually call a model into a variable (normally in the controlle's show method), but they might as well make a mix of some related models to represent the resource that they want to expose. In this second case, they then have to rip the params off in the update action, so that they get the different models to validate and save and so on. That's what I see as a weak part of the framework. I feel that josevalim's argument could backing up a kind of \"presenters-and-back\" as a best way to translate/map models into resources, and that the implementation of such a paradigm into Rails should be seriously weighted. Were they dismissed (which I suppose, for that is a whole subject in itself), I would then come to my conclusion: __I dislike disregarding a new method called `replace_resource`__ , which sets all empty attributes to nil (or blank, depending on validation rules), supposed that it gets applied on a single model. You can afterwards put all needed warnings in the documentation about the semantic meaning of it. I mean, Rails 4 is going to promote a new verb just to adhere to standards, without any appreciable gain in the short term, just for the sake of it? Do you really mean that you are going to leave devs on their own, having to understand why to use this or that, without further help? _\"Boy, if you want to make proper use of this new feature that we advocate, you'll have to write your own methods for it, it's just 30LOC, boy. After all, Rails is just a framework, don't expect too much from us.\"_\r\n\r\nSee my point? I know I am a bit sarcastic at giving reasons for my petition, but I do it just in order to make it crystal clear and avoid another six months of discussion on the need of such method. I hope I got it.\r\n\r\nPS. Sorry for coming in so late, I just saw the thread linked in the Rails Blog. I got through the whole of it, oh my!", "_id": {"$oid": "52385f14bd3543c151012178"}, "issue_id": 505, "url": "https://api.github.com/repos/rails/rails/issues/comments/4758652", "html_url": "https://github.com/rails/rails/pull/505#issuecomment-4758652", "updated_at": "2012-03-28T12:13:23Z", "user": {"subscriptions_url": "https://api.github.com/users/miguelsan/subscriptions", "events_url": "https://api.github.com/users/miguelsan/events{/privacy}", "repos_url": "https://api.github.com/users/miguelsan/repos", "gists_url": "https://api.github.com/users/miguelsan/gists{/gist_id}", "url": "https://api.github.com/users/miguelsan", "login": "miguelsan", "gravatar_id": "e6bda02fb14b6e1d925cfd451aa6a8e9", "html_url": "https://github.com/miguelsan", "following_url": "https://api.github.com/users/miguelsan/following{/other_user}", "received_events_url": "https://api.github.com/users/miguelsan/received_events", "organizations_url": "https://api.github.com/users/miguelsan/orgs", "avatar_url": "https://0.gravatar.com/avatar/e6bda02fb14b6e1d925cfd451aa6a8e9?d=https%3A%2F%2Fidenticons.github.com%2F2b69a141362f27f1639da245d0ecc7dd.png", "starred_url": "https://api.github.com/users/miguelsan/starred{/owner}{/repo}", "id": 522879, "followers_url": "https://api.github.com/users/miguelsan/followers", "type": "User"}, "created_at": "2012-03-28T12:09:28Z", "id": 4758652, "owner": "rails"}
