{"body": ">@arturopie so benchmark, profile and provide data on hotspots. The main point of an Identity Map is to provide object consistency, most of the performance benefits of it is already available via the query cache.\n\nI don't have access to that data right now, but I can give you some conclusions from the benchmark.\n\nAfter upgrading to rails 3.1, we realized that our app was spending too much time on the Ruby Garbage Collector. We had already optimized our GC settings, so this was bad news. After further investigation, we found that rails was creating a lot more strings objects, that were triggering the GC more often.\n\nOur slowest requests were the ones that loaded the same records multiple times. They were using the query cache but that wasn't good enough because at that point, AR already created the SQL query, which apparently, requires to create a lot of strings. So, if we could load the object before creating the SQL query, we could get some improvements. There is when we try IM and the performance improved a lot for those slow requests. Indeed, the number of strings created were much lower with IM enabled.\n\nAnother way to easily verify this was by looking at AR logs. With IM off, there were a lot of outputs from the query cache in the console, but after printing several lines, I could see there were small pauses. This pauses were occuring because the GC was working at that moment. With IM on, there were no more query cache logs, and a lot of outputs from IM; however, the pauses disappeared or were only a few.\n\nTo conclude, if we can use a cache earlier in the execution (IM), we will get a better performance benefit than using it much later (query cache).", "url": "https://api.github.com/repos/rails/rails/issues/comments/6012903", "created_at": "2012-05-30T15:28:59Z", "html_url": "https://github.com/rails/rails/pull/6524#issuecomment-6012903", "updated_at": "2012-05-30T15:28:59Z", "repo": "rails", "issue_id": 6524, "user": {"following_url": "https://api.github.com/users/arturopie/following{/other_user}", "events_url": "https://api.github.com/users/arturopie/events{/privacy}", "organizations_url": "https://api.github.com/users/arturopie/orgs", "url": "https://api.github.com/users/arturopie", "gists_url": "https://api.github.com/users/arturopie/gists{/gist_id}", "html_url": "https://github.com/arturopie", "subscriptions_url": "https://api.github.com/users/arturopie/subscriptions", "avatar_url": "https://0.gravatar.com/avatar/a812dec16b0581384b02c590c8a29d97?d=https%3A%2F%2Fidenticons.github.com%2F480558e557be110d24c6666170c0bb94.png", "repos_url": "https://api.github.com/users/arturopie/repos", "received_events_url": "https://api.github.com/users/arturopie/received_events", "gravatar_id": "a812dec16b0581384b02c590c8a29d97", "starred_url": "https://api.github.com/users/arturopie/starred{/owner}{/repo}", "login": "arturopie", "type": "User", "id": 762752, "followers_url": "https://api.github.com/users/arturopie/followers"}, "owner": "rails", "_id": {"$oid": "523e4e93bd354364b900ee81"}, "id": 6012903, "issue_url": "https://api.github.com/repos/rails/rails/issues/6524"}
