{"body": "@headius let me reply since I expressed my opinion that I prefer the flag to be off.\n\nFirst of all, I understand people that run or want to run in a threaded environment. That's awesome, but that by itself is not the criteria you use to choose a configuration _default_ value.\n\nSome say \"hey, I love JRuby and have been running an app with threadsafe on in production with excellent results\". Fine, but that is not an enough argument for a change in a generated flag from my perspective. The measure to choose a default value for me is a balance between what makes sense in practical terms looking at the project and the community *as a whole*, and which is the value most people won't touch.\n\nI think we will all agree that multi-process is dominant today. I don't think it is a good idea to flip this for all users in Rails 4 because albeit it is fantastic to push this stuff to find bugs, in practice that means bugs in production for end-users that are running multi-process anyway.\n\nAs a project maintainer that sounds backwards for me. If you are running in multi-process and you want to use this in production and provide feedback, then *you* should be the one turning the flag on.\n\nLastly, about the existence of the flag, it would be awesome to be able to claim that Rails is thread-safe and remove it. Well, you need to forget about constant autoloading and some stuff that's nice in development mode and not thread-safe, so in the mid term Rails is not going to be thread-safe in all environments. Therefore, we cannot remove the flag.\n\nLet me stress this reply is not about threads vs processes, my answer addresses this particular pull request that wants to change a default value.\n", "url": "https://api.github.com/repos/rails/rails/issues/comments/6258848", "created_at": "2012-06-11T23:12:21Z", "html_url": "https://github.com/rails/rails/pull/6685#issuecomment-6258848", "updated_at": "2012-06-11T23:16:31Z", "repo": "rails", "issue_id": 6685, "user": {"following_url": "https://api.github.com/users/fxn/following{/other_user}", "events_url": "https://api.github.com/users/fxn/events{/privacy}", "organizations_url": "https://api.github.com/users/fxn/orgs", "url": "https://api.github.com/users/fxn", "gists_url": "https://api.github.com/users/fxn/gists{/gist_id}", "html_url": "https://github.com/fxn", "subscriptions_url": "https://api.github.com/users/fxn/subscriptions", "avatar_url": "https://2.gravatar.com/avatar/7223c62b7310e164eb79c740188abbda?d=https%3A%2F%2Fidenticons.github.com%2F4a11654ad1e1e48352252859ff3032a0.png", "repos_url": "https://api.github.com/users/fxn/repos", "received_events_url": "https://api.github.com/users/fxn/received_events", "gravatar_id": "7223c62b7310e164eb79c740188abbda", "starred_url": "https://api.github.com/users/fxn/starred{/owner}{/repo}", "login": "fxn", "type": "User", "id": 3387, "followers_url": "https://api.github.com/users/fxn/followers"}, "owner": "rails", "_id": {"$oid": "52380552bd3543c15100c6fe"}, "id": 6258848, "issue_url": "https://api.github.com/repos/rails/rails/issues/6685"}
