{"issue_url": "https://api.github.com/repos/rails/rails/issues/8499", "repo": "rails", "body": "@dhh the original functionality was put in a Gem https://rubygems.org/gems/sextant that has had over thirty-three thousand downloads in the last few months, it was added into Rails 4 after some on the core team reached out to me. I wrote a blog post on the ideals behind this and my other work in [Raise Hell: Better programming through Error Messages](http://schneems.com/post/31460949407/raise-hell-better-programming-through-error-messages).\r\n\r\nI teach Rails at the University of Texas and this functionality came straight from user research with my students, as well as requests from seasoned Rails devs. The Engine is very limited in capacity, i'll get to that but first a quick recap on reasoning behind adding this functionality:\r\n\r\n1. Moving the routing into the Rails app, eliminates the need to boot the app to spit out the routes (such as when running `rake routes`). For some larger apps i've worked on this cuts down the time to see the routes from 30 seconds + to nearly instantaneously. This insanely reduced time allows for quick iteration, and less hairpulling. The Engine can give us this, but that is about it.\r\n2. When you get a routing error, it's because you either mis-typed something or you misinterpreted something in your routes. I can't help with the first, but we can show you the result of your routes on the error page. This info is presented just-in-time and gives you everything you need to fix your mistake. An engine doesn't have the hooks to add information to one of the built in error pages without totally over-writing it.\r\n3. The intent of this yet to be completed PR as @steveklabnik mentioned, is to add semantics and additional info to the rendering of the information which is not possible while outputting to the console.\r\n4. While these three pieces are great for seasoned devs, where they really shines is for beginners. When someone is first learning Rails, Routing is one of the hardest things to grok, making this information harder to find, and longer to get to only adds to the pain and confusion. Having it baked into Rails means it is available out of the box, with no configuration needed means developers of all skill levels have this information at their fingertips.\r\n\r\nIf you want to revert this PR, I'm all for it... it is still a WIP, I ask that you don't revert the other functionality without the pieces in place to provide an adequate replacement. I would be interested in helping out more with adding in some of those hooks if you're willing to give me some guidance.", "_id": {"$oid": "5237f2a1bd3543c15100a67d"}, "issue_id": 8499, "url": "https://api.github.com/repos/rails/rails/issues/comments/11391508", "html_url": "https://github.com/rails/rails/pull/8499#issuecomment-11391508", "updated_at": "2012-12-14T20:41:58Z", "user": {"subscriptions_url": "https://api.github.com/users/schneems/subscriptions", "events_url": "https://api.github.com/users/schneems/events{/privacy}", "repos_url": "https://api.github.com/users/schneems/repos", "gists_url": "https://api.github.com/users/schneems/gists{/gist_id}", "url": "https://api.github.com/users/schneems", "login": "schneems", "gravatar_id": "db953d125f5cc49756edb6149f1b813e", "html_url": "https://github.com/schneems", "following_url": "https://api.github.com/users/schneems/following{/other_user}", "received_events_url": "https://api.github.com/users/schneems/received_events", "organizations_url": "https://api.github.com/users/schneems/orgs", "avatar_url": "https://0.gravatar.com/avatar/db953d125f5cc49756edb6149f1b813e?d=https%3A%2F%2Fidenticons.github.com%2F6ef42a6eab211ddd71ac423a80b42d15.png", "starred_url": "https://api.github.com/users/schneems/starred{/owner}{/repo}", "id": 59744, "followers_url": "https://api.github.com/users/schneems/followers", "type": "User"}, "created_at": "2012-12-14T20:41:58Z", "id": 11391508, "owner": "rails"}
