{"updated_at": "2013-02-09T17:40:59Z", "repo": "rails", "created_at": "2013-02-09T17:32:39Z", "owner": "rails", "url": "https://api.github.com/repos/rails/rails/issues/comments/13334753", "id": 13334753, "issue_url": "https://api.github.com/repos/rails/rails/issues/9221", "issue_id": 9221, "user": {"repos_url": "https://api.github.com/users/thenickcox/repos", "type": "User", "html_url": "https://github.com/thenickcox", "starred_url": "https://api.github.com/users/thenickcox/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/thenickcox/subscriptions", "following_url": "https://api.github.com/users/thenickcox/following{/other_user}", "gravatar_id": "63f35d9e50dfd73281126b051a51668a", "organizations_url": "https://api.github.com/users/thenickcox/orgs", "url": "https://api.github.com/users/thenickcox", "gists_url": "https://api.github.com/users/thenickcox/gists{/gist_id}", "avatar_url": "https://2.gravatar.com/avatar/63f35d9e50dfd73281126b051a51668a?d=https%3A%2F%2Fidenticons.github.com%2F2556537a6c0e75677aad7a014b98e770.png", "id": 702327, "events_url": "https://api.github.com/users/thenickcox/events{/privacy}", "login": "thenickcox", "received_events_url": "https://api.github.com/users/thenickcox/received_events", "followers_url": "https://api.github.com/users/thenickcox/followers"}, "body": "I'm not sure why you would say that mentioning Voice Over is \"wrong\", @acapilleri. The reason I mention it is that it's a screen reader, and that screen readers for the vision impaired are, I would argue, the primary use case for the `alt` attribute. (I also don't think that [W3 Schools](http://www.w3schools.com) is a valid reference, as argued [here](http://w3fools.com/).) \r\n\r\nThe definition, as you state it, is mostly correct, but incomplete. As noted in the (SitePoint Reference)(http://reference.sitepoint.com/html/img/alt), \r\n\r\n>[If] the user is visually impaired and is accessing the content using a screen reader—the alt \r\n>attribute provides alternative content that can be displayed instead of the image.\r\n\r\n[456 Berea St](http://www.456bereastreet.com/archive/200412/the_alt_and_title_attributes/) also has a good write up on the alt tag and its use in screen readers. And the [W3 specification](http://www.w3.org/TR/html4/struct/objects.html#adef-alt) mentions other use cases, primarily focused on accessibility, not instances where the image won't load:\r\n\r\n>Specifying alternate text assists users without graphic display terminals, users whose browsers don't support forms, visually impaired users, those who use speech synthesizers, those who have configured their graphical user agents not to display images, etc.\r\n\r\nThus, screen readers are my primary concern, as noted in the pull request title, because I think accessibility is important. So the reason I mention Voice Over is twofold: \r\n\r\n1. The current implementation is broken in Voice Over\r\n2. That was the screen reader with which I tested it\r\n\r\nFurther, I didn't need to test it in any other screen readers because it was broken on Apple computers, a significant enough portion of the market that, even if this worked on every other screen reader, it would still need fixing for Apple's Voice Over.\r\n\r\nLastly, in the other use cases that you correctly point out, if the image doesn't display, the text should describe the image, and a long, hyphenated and capitalized string doesn't work well for that case, either. \r\n\r\nSo whatever the reason that an `alt` attribute is being displayed, whether it's by a screen reader, because the user is using a headless web browser, because the image path is incorrectly specified, because the user has a slow connection and it hasn't rendered yet, or any other reason, this description needs to read like a normal phrase.\r\n", "_id": {"$oid": "523d411fbd354364b9005b01"}, "html_url": "https://github.com/rails/rails/pull/9221#issuecomment-13334753"}
